| Category               | Score | Notes |
|------------------------+-------+-------|
| Correctness task0 (10) |    10 |       |
| Correctness task1 (20) |    15 |     1 |
| Correctness task2 (20) |    17 |     2 |
| Correctness task3 (20) |     0 |     3 |
|------------------------+-------+-------|
| structure (20)         |    10 |     4 |
| Documentation  (10)    |    10 |       |
| Misc                   |       |       |
|------------------------+-------+-------|
| Total                  |    62 |       |
#+TBLFM: @>$2=vsum(@2..@-1)

* Notes
1. Code looks right but you never run it or show it works.
2. Code looks right but example doesn't seem to work so there appears
   to be a small error
3. incomplete
4. new code should be in a new file such as tasks.cpp - you shouldn't
   change a file with "library code" that's given to you. Also you
   shouldn't copy the code from writeImage into each task, you should
   just call writeImage. Finally, the project should have been written
   to follow specifications (task0 task1 etc).
